# 1. Используем легкий официальный базовый образ Python версии 3.13
FROM python:3.13-slim

# 2. Отключаем буферизацию вывода Python (логи сразу выводятся в консоль Docker)
ENV PYTHONUNBUFFERED=1

# 3. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 4. Сначала копируем только файл зависимостей (для эффективного кэширования слоев Docker)
COPY requirements.txt .

# 5. Устанавливаем зависимости без сохранения кэша wheels
RUN pip install --no-cache-dir -r requirements.txt

# 6. Копируем исходный код приложения в рабочую папку контейнера
COPY bot.py .

# 7. Задаем команду для старта бота при запуске контейнера
CMD ["python", "bot.py"]